
# +, -, *, **, /, //, %

# 一，+ 加法运算符
# 加法运算符很简单，和数学中的规则一样。
print("---- 加法运算 ----")
m = 10
n = 97
sum1 = m + n
x = 7.2
y = 15.3
sum2 = x + y
print("sum1=%d, sum2=%.2f" % (sum1, sum2) )

# 拼接字符串
# 当+用于数字时表示加法，但是当+用于字符串时，它还有拼接字符串（将两个字符串连接为一个）的作用。
name = "C语言中文网"
url = "http://c.biancheng.net/"
age = 8
info = name + "的网址是" + url + "，它已经" + str(age) + "岁了。"
print(info)

# 二，- 减法运算符
# 减法运算也和数学中的规则相同。
print("---- 减法运算 ----")
n = 45
m = -n
x = -83.5
y = -x
print(m, ",", y)

# 求负
# 除了可以用作减法运算之外，还可以用作求负运算（正数变负数，负数变正数。
n = 45
n_neg = -n
f = -83.5
f_neg = -f
print(n_neg, ",", f_neg)

# 三，＊乘法运算符
# 乘法运算也和数学中的规则相同。
print("---- 乘法运算 ----")
n = 4 * 25
f = 34.5 * 2
print(n, ",", f)

# 重复字符串
# 除了可以用作乘法运算，还可以用来重复字符串，也即将 n 个同样的字符串连接起来。
str1 = "hello "
print(str1 * 4)

# 四，/ 和 // 除法运算符
# Python 支持/和//两个除法运算符，但它们之间是有区别的：
# /表示普通除法，使用它计算出来的结果和数学中的计算结果相同。
# //表示整除，只保留结果的整数部分，舍弃小数部分；注意是直接丢掉小数部分，而不是四舍五入。
#整数不能除尽
print("---- 除法运算 ----")
print("整数不能除尽")
print("23/5 =", 23/5)
print("23//5 =", 23//5)
print("23.0//5 =", 23.0//5)

#整数能除尽
print("整数能除尽")
print("25/5 =", 25/5)
print("25//5 =", 25//5)
print("25.0//5 =", 25.0//5)

#小数除法
print("小数除法")
print("12.4/3.5 =", 12.4/3.5)
print("12.4//3.5 =", 12.4//3.5)

# 五，% 求余运算符
# Python % 运算符用来求得两个数相除的余数，包括整数和小数。
# Python 使用第一个数字除以第二个数字，得到一个整数的商，剩下的值就是余数。对于小数，求余的结果一般也是小数。
# 注意，求余运算的本质是除法运算，所以第二个数字也不能是 0，否则会导致 ZeroDivisionError 错误。
print("---- 取余运算 ----")
print("整数求余")
print("15%6 =", 15%6)
print("-15%6 =", -15%6)
print("15%-6 =", 15%-6)
print("-15%-6 =", -15%-6)
print("小数求余")
print("7.7%2.2 =", 7.7%2.2)
print("-7.7%2.2 =", -7.7%2.2)
print("7.7%-2.2 =", 7.7%-2.2)
print("-7.7%-2.2 =", -7.7%-2.2)
print("整数和小数运算")
print("23.5%6 =", 23.5%6)
print("23%6.5 =", 23%6.5)
print("23.5%-6 =", 23.5%-6)
print("-23%6.5 =", -23%6.5)
print("-23%-6.5 =", -23%-6.5)

# 六，** 次方（乘方）运算符
# Python ** 运算符用来求一个 x 的 y 次方，也即次方（乘方）运算符。
# 由于开方是次方的逆运算，所以也可以使用 ** 运算符间接地实现开方运算。
print("---- 次方运算 ----")
print('次方运算')
print('3**4 =', 3**4)
print('2**5 =', 2**5)
print('开方运算')
print('81**(1/4) =', 81**(1/4))
print('32**(1/5) =', 32**(1/5))


